{
  "tag_type": "P",
  "content": "Annexure-\nAGREEMENT FORMAT\n(ON NON-JUDICIAL STAMP PAPER OF Rs100/- VALUE)\nThis agreement is made on 26th October 2025 between SolarEdge Energy Ltd. having its\nregistered office at Ahmedabad, Gujarat\n(hereinafter referred to as the “Employer”) and NovaStruct Engineering having its registered office\nat Pune, Maharashtra\n(hereinafter referred to as the “Contractor”).\nWhereas the Employer is desirous that the Contractor executes Wind Turbine Maintenance\nContract (hereinafter called “the Works”) and\nthe Employer has accepted the Bid submitted by the Contractor for the execution and completion of\nsuch Works and\nthe remedying of any defects therein, at an Accepted Contract Amount of n1,95,00,000 (Rupees\nOne Crore Ninety-Five Lakh Only).\nNOW THIS AGREEMENT WITNESSETH as follows:\n1. In this Agreement, words and expression shall assume the same meanings as are respectively\nassigned to them in\nthe Conditions of Contract hereinafter referred to and they shall be deemed to form and be read\nand construed as part of this Agreement.\n2. In consideration of the payments to be made by the Employer to the Contractor as indicated in\nthis Agreement, the Contractor hereby covenants and agrees with the Employer that the contractor\nshall execute and complete the Works and\nremedy the defects therein in conformity in all respects with the provisions of the Contract and shall\nundertake, ensure and process the completion of the Works within the Time for Completion.\n3. The Employer hereby covenants and agrees to pay the Contractor in consideration of the\nexecution and completion\nof the Works and the remedying the defects therein, the Accepted Contract Amount or such other\nsum as may\nbecome payable under the provisions of the Contract at the times and in the manner prescribed by\nthe Contract.\n4. The contractor undertakes to execute and complete the Works within the Time for Completion\nand to achieve the\nMilestones within the time prescribed thereof in the Contract.\n5. The following documents shall be deemed to form and be read and construed as integral part of\nthis Agreement:\nThis Agreement shall prevail over all other Contract Documents.",
  "attributes": {
    "alt": "",
    "lang": "en",
    "actualText": "Annexure- AGREEMENT FORMAT (ON NON-JUDICIAL STAMP PAPER OF Rs100/- VALUE) This agreement is made on 26th October 2025 between SolarEdge Energy Ltd. having its registered office at Ahmedabad, Gujarat (hereinafter referred to as the “Employer”) and NovaStruct Engineering having its registered office at Pune, Maharashtra (hereinafter referred to as the “Contractor”). Whereas the Employer is desirous that the Contractor executes Wind Turbine Maintenance Contract (hereinafter called “the Works”) and",
    "title": "Agreement Introduction and Parties",
    "checked": null,
    "columnSpan": null,
    "headers": null,
    "id": null,
    "name": null,
    "next": null,
    "prev": null,
    "role": null,
    "rowSpan": null,
    "summary": "This paragraph serves as the introductory section of an agreement. It specifies that the document is an agreement format requiring a non-judicial stamp paper of Rs100/- value. It states the effective date of the agreement as October 26, 2025. The paragraph then identifies the two principal parties involved: SolarEdge Energy Ltd., referred to as the 'Employer', with its registered office in Ahmedabad, Gujarat; and NovaStruct Engineering, referred to as the 'Contractor', with its registered office in Pune, Maharashtra. Finally, it outlines the Employer's intent for the Contractor to undertake a 'Wind Turbine Maintenance Contract', which is subsequently referred to as 'the Works'."
  },
  "page": 1,
  "children": null
}