{
  "role": "paragraph",
  "semantic_type": "intro",
  "summary": "This section introduces a sample employment contract, outlining the parties involved, the agreement's purpose, the indefinite term of employment, a six-month probationary period with specific conditions, and initial details regarding compensation and benefits.",
  "reading_order": 1,
  "description": "The document begins with the title, 'SAMPLE CONTRACT OF EMPLOYMENT'. Following this, an introductory paragraph states, 'This agreement, made on the [blank line] day of the [blank line] month of the year [blank line]'. A section labeled 'Between:' identifies the parties: a blank line followed by '(hereinafter referred to as \"the Employer\")' and another blank line followed by '(hereinafter referred to as \"the Employee\")'. A 'WHEREAS' clause explains the purpose: 'the Employee and the Employer wish to enter into an employment agreement governing the terms and conditions of employment;'. This is followed by a 'THIS AGREEMENT WITNESSETH' clause, stating that 'in consideration of the premises and mutual covenants and agreements hereinafter contained is hereby acknowledged and agreed by and between the parties hereto as follows:'. The agreement then proceeds with numbered clauses. Clause 1, titled 'Term of Employment', states: 'The employment of the Employee shall commence from the date hereof and continue for an indefinite term until terminated in accordance with the provisions of this agreement.' Clause 2, titled 'Probation', explains: 'The parties hereto agree that the initial six (6) month period of this agreement is \"Probationary\" in the following respects:'. This clause then lists three sub-points: 'a. the Employer shall have an opportunity to assess the performance, attitude, skills and other employment-related attributes and characteristics of the Employee;', 'b. the Employee shall have an opportunity to learn about both the Employer and the position of employment;', and 'c. either party may terminate the employment relationship at any time during the initial six month period with advance notice of seven days with justifiable reason, in which case there will be no continuing obligations of the parties to each other, financial or otherwise.' Clause 3, titled 'Compensation and Benefits', details: 'In consideration of the services to be provided by him hereunder, the Employee, during the term of his employment, shall be paid a basic salary of Nu. [blank line] a month/ week, less applicable statutory deductions. In addition, the Employee is entitled to receive benefits in accordance with the Employer's standard benefit package, as amended from time to time.'",
  "key_points": [
    "This document is a sample contract of employment.",
    "It identifies the Employer and Employee as the parties to the agreement.",
    "The agreement establishes an indefinite term of employment, commencing from the date of the agreement.",
    "An initial six-month probationary period is defined, allowing for assessment by the Employer and learning by the Employee.",
    "During probation, either party may terminate the employment with seven days' notice for a justifiable reason, with no continuing obligations.",
    "Compensation includes a basic salary (amount to be specified) paid monthly or weekly, subject to statutory deductions.",
    "The Employee is entitled to benefits according to the Employer's standard benefit package."
  ]
}